{
  "jedi:sworddojo" :
  {
    "NAME" : "Sword Dojo",
    "DESCRIPTIONS" :
            [
              "You come across an abandoned sword dojo. No living soul can be found anywhere. The hall you see has many praying mats in it, as well as a treasure chest in front of them.",
              "You decide to sit on a praying mat and meditate. Soon you start feeling sharp knowledge penetrating into your mind, giving you new mastery with the sword.",
              "You decide to open the chest. Inside you can see a well-preserved book, showing the martial arts knowledge from many different styles, some even look #p~alien~ or #b~artificial.~ NL It will be of great help in your combats.",
              "Nothing interests you in this abandoned temple. You decide to not touch anything and leave.",
              "Striking knowledge..."
            ],
    "OPTIONS" :
            [
              "[Meditate] Your basic #yStrikes become #yImperfected.",
              "[Locked] You have no basic Strikes.",
              "[Chest] Obtain a #yspecial relic.",
              "[Leave]"
            ]
  },
  "jedi:ShrineOfCommand":
  {
    "NAME": "Shrine of Command",
    "DESCRIPTIONS":
            [
              "You come across a weird-looking shrine. Above it, you see an ancient crown floating mysteriously. It #b~commands~ you for great sacrifices, offering #y~riches~ and ~limitless~ #r~power.~",
              "Sacrifices must be made.",
              "#y[Approach] Offer #rgreat sacrifices to command your fate.",
              "[Leave]"
            ],
    "OPTIONS":
            [
              "#r[Lose #r%d #rHP] Choose a #ycommon relic to obtain.",
              "#r[Lose #ra #rpotion #rslot] Choose an #yuncommon relic to obtain.",
              "#r[Become #rCursed - #rBattle #rThirst] Choose a #yrare relic to obtain.",
              "#r[Lose #r%d #rMax #rHP] Choose a #yboss relic to obtain.",
              "#r[Lose #rALL #rGold] Choose a #yshop relic to obtain.",
              "#r[DIE] Until the end of this run, choose what relics you obtain.",
              "[Leave]",
              "[Locked] Requires: 1 or more potion slots.",
              "[Locked] Requires: 200 or more gold."
            ]
  },
  "jedi:GuildOfFate":
  {
    "NAME": "Guild of Fate",
    "DESCRIPTIONS":
            [
              "Making your way through the streets, you notice a random paper on the wall. It reads: NL \"On this very spot, at exactly %s, your fate WILL change drastically.\" NL You realise that these are the present date and present time. Suddenly, as you hear a menacing laughter behind you, you decide...",
              "You turn around and see a typical dirty-looking charlatan face. Unfazed by your judgement, he flips a coin high into the air, catches it, after which silently shoves it into your hand. NL As you look at it, you see...",
              "You value the future you know too much to change it for the unknown. You run away without looking back."
            ],
    "OPTIONS":
            [
              "[Turn around] Change your future.",
              "[Flee]",
              "#r[Nob]",
              "#b[Question #bMark]",
              "#g[Campfire]",
              "#y[Smiling #yMask]",
              " Obtain a special relic.",
              "[Leave]"
            ]
  }
}